TUT materials/T2-3MI3/T2.org
#+TITLE: Tutorial #2 - Working on your assignment
#+author: Habib Ghaffari
#+date: 2022-09-19 Mon
# Use # for commenting your Org file
# Here I am adding the latex header
#+latex_header: \usepackage{hyperref}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{listings}
#+latex_header: \usepackage{xcolor}
#+latex_header: \usepackage{graphicx}


# Adding the color definitions
#+latex_header_extra: \definecolor{codegreen}{rgb}{0,0.6,0}
#+latex_header_extra: \definecolor{codegray}{rgb}{0.5,0.5,0.5}
#+latex_header_extra: \definecolor{codepurple}{rgb}{0.58,0,0.82}
#+latex_header_extra: \definecolor{backcolour}{rgb}{0.95,0.95,0.92}


# Adding the latex code for stylish code display
#+latex_header_extra: \lstdefinestyle{mystyle}{
#+latex_header_extra:      backgroundcolor=\color{backcolour},   
#+latex_header_extra:      commentstyle=\color{codegreen},
#+latex_header_extra:      keywordstyle=\color{magenta},
#+latex_header_extra:      numberstyle=\tiny\color{codegray},
#+latex_header_extra:      stringstyle=\color{codepurple},
#+latex_header_extra:      basicstyle=\ttfamily\footnotesize,
#+latex_header_extra:      breakatwhitespace=false,         
#+latex_header_extra:      breaklines=true,                 
#+latex_header_extra:      captionpos=b,                    
#+latex_header_extra:      keepspaces=true,                 
#+latex_header_extra:      numbers=left,                    
#+latex_header_extra:      numbersep=5pt,                  
#+latex_header_extra:      showspaces=false,                
#+latex_header_extra:      showstringspaces=false,
#+latex_header_extra:      showtabs=false,                  
#+latex_header_extra:      tabsize=2
#+latex_header_extra:  }
#+latex_header_extra:  \lstset{style=mystyle, language=Python}


* Introduction

The objective of this tutorial is to work on some examples that will help you
with your assignments. For this tutorial, I am still going to continue working
with ~Haskell~. The solutions we are presenting may/may not be related to your
assignment. It is your responsibility to find the relevance and try to figure out
how you could use it in your submissions. I am also going to give you a brief
introduction to the ~Hakell~ while I am presenting this tutorial.


* Objective

+ Becoming familiar with ~Haskell~.
+ Learn how to expand the regular expression based on what we defined last
  week.
+ Learn to apply ~BNF~ for our definitions.
+ Learn how to use ~Haskell~ for the implementation of a recursive parser to
  parse our expressions.


* Learn how to work with ~Haskell~

** Installing ~Haskell~ interpreter

   ~GHCI~ is ~Haskell~ interpreter It is an interactive environment, in which
   ~Haskell~ expressions can be interactively evaluated and programs can be
   interpreter. But in order to have the most stable installation, we recommend
   you install ~GHCI~ using ~Stack~.


   ~Stack~ is a cross-platform program for developing Haskell projects. It is
   aimed at Haskellers both new and experienced. In order to install ~Stack~ you
   can download it for your machine and the OS you are using from [[https://docs.haskellstack.org/en/stable/README/][here]].


   After installation of ~Stack~ there are some other things that you can do in
   order to take the best out of it. One of the best IDEs for ~Haskell~
   implementation is ~IntelliJ IDEA~. In order to make ~Stack~ work properly
   with this IDE follow the instruction below.

   + Open your ~Terminal~ or ~Command Prompt~ and run the following command

   #+begin_src bash
     stack install hindent stylish-haskell
   #+end_src
   + Download and install ~IntelliJ IDEA~. Since you are a student you can use
     ~IDEA~ and other IDEs of ~IntelliJ~ for free as long as you use your
     academic email address. The process is straightforward. Just register for
     an account in IntelliJ's website and apply for an activation license. You may
     ask to renew your license annually.
   + Open ~IDEA~ and install ~Intellij-Haskell~ plugin and restart the IDE.
   + Open the ~IDEA~ again and make a new project.
     - Select ~Stack binary~.
     - In the next step choose the proper ~SDK~. Most of the time ~IDEA~
       automatically going to detect the stack path. If not just manually select
       it.

  Now you are ready to start working with ~IDEA~ and ~Haskell~ programming.

  *Note:* You can also use other IDEs such as ~VSCode~ while using ~Stack~. For
  that just try to find the proper instruction to configure your IDE.

  Now it is time to do some ~Haskell~ programming.

