TUT materials/T2-3MI3/T2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-10-04 Tue 11:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tutorial #2 - Working on your assignment</title>
<meta name="author" content="Habib Ghaffari" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Tutorial #2 - Working on your assignment</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6d7cdde">1. Introduction</a></li>
<li><a href="#orgf2ca1de">2. Objective</a></li>
<li><a href="#org19d2d47">3. Learn how to work with <code>Haskell</code></a>
<ul>
<li><a href="#org909268b">3.1. Installing <code>Haskell</code> interpreter</a></li>
<li><a href="#org7b48af9">3.2. Introduction to <code>Haskell</code> programming</a></li>
<li><a href="#org32d03d3">3.3. Naming Conventions in Haskell</a></li>
</ul>
</li>
<li><a href="#orgb69901d">4. Language Definition</a></li>
</ul>
</div>
</div>


<div id="outline-container-org6d7cdde" class="outline-2">
<h2 id="org6d7cdde"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The objective of this tutorial is to work on some examples that will help you
with your assignments. For this tutorial, I am still going to continue working
with <code>Haskell</code>. The solutions we are presenting may/may not be related to your
assignment. It is your responsibility to find the relevance and try to figure out
how you could use it in your submissions. I am also going to give you a brief
introduction to the <code>Hakell</code> while I am presenting this tutorial.
</p>
</div>
</div>


<div id="outline-container-orgf2ca1de" class="outline-2">
<h2 id="orgf2ca1de"><span class="section-number-2">2.</span> Objective</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Becoming familiar with <code>Haskell</code>.</li>
<li>Learn how to expand the regular expression based on what we defined last
week.</li>
<li>Learn to apply <code>BNF</code> for our definitions.</li>
<li>Learn how to use <code>Haskell</code> for the implementation of a recursive parser to
parse our expressions.</li>
</ul>
</div>
</div>


<div id="outline-container-org19d2d47" class="outline-2">
<h2 id="org19d2d47"><span class="section-number-2">3.</span> Learn how to work with <code>Haskell</code></h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org909268b" class="outline-3">
<h3 id="org909268b"><span class="section-number-3">3.1.</span> Installing <code>Haskell</code> interpreter</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<code>GHCI</code> is <code>Haskell</code> interpreter It is an interactive environment, in which
<code>Haskell</code> expressions can be interactively evaluated and programs can be
interpreter. But in order to have the most stable installation, we recommend
you install <code>GHCI</code> using <code>Stack</code>.
</p>


<p>
<code>Stack</code> is a cross-platform program for developing Haskell projects. It is
aimed at Haskellers both new and experienced. In order to install <code>Stack</code> you
can download it for your machine and the OS you are using from <a href="https://docs.haskellstack.org/en/stable/README/">here</a>.
</p>


<p>
After installation of <code>Stack</code> there are some other things that you can do in
order to take the best out of it. One of the best IDEs for <code>Haskell</code>
implementation is <code>IntelliJ IDEA</code>. In order to make <code>Stack</code> work properly
with this IDE follow the instruction below.
</p>

<ul class="org-ul">
<li>Open your <code>Terminal</code> or <code>Command Prompt</code> and run the following command</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">stack install hindent stylish-haskell
</pre>
</div>
<ul class="org-ul">
<li>Download and install <code>IntelliJ IDEA</code>. Since you are a student you can use
<code>IDEA</code> and other IDEs of <code>IntelliJ</code> for free as long as you use your
academic email address. The process is straightforward. Just register for
an account in IntelliJ's website and apply for an activation license. You may
ask to renew your license annually.</li>
<li>Open <code>IDEA</code> and install <code>Intellij-Haskell</code> plugin and restart the IDE.</li>
<li>Open the <code>IDEA</code> again and make a new project.
<ul class="org-ul">
<li>Select <code>Stack binary</code>.</li>
<li>In the next step choose the proper <code>SDK</code>. Most of the time <code>IDEA</code>
automatically going to detect the stack path. If not just manually select
it.</li>
</ul></li>
</ul>

<p>
Now you are ready to start working with <code>IDEA</code> and <code>Haskell</code> programming.
</p>

<p>
<b>Note:</b> You can also use other IDEs such as <code>VSCode</code> while using <code>Stack</code>. For
that just try to find the proper instruction to configure your IDE.
</p>

<p>
Now it is time to do some <code>Haskell</code> programming.
</p>
</div>
</div>
