TUT materials/T2-3MI3/T2.tex
% Created 2022-10-04 Tue 11:42
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{hyperref}
\usepackage{amsmath}
\usepackage{listings}
\usepackage{xcolor}
\usepackage{graphicx}
\definecolor{codegreen}{rgb}{0,0.6,0}
\definecolor{codegray}{rgb}{0.5,0.5,0.5}
\definecolor{codepurple}{rgb}{0.58,0,0.82}
\definecolor{backcolour}{rgb}{0.95,0.95,0.92}
\lstdefinestyle{mystyle}{
backgroundcolor=\color{backcolour},
commentstyle=\color{codegreen},
keywordstyle=\color{magenta},
numberstyle=\tiny\color{codegray},
stringstyle=\color{codepurple},
basicstyle=\ttfamily\footnotesize,
breakatwhitespace=false,
breaklines=true,
captionpos=b,
keepspaces=true,
numbers=left,
numbersep=5pt,
showspaces=false,
showstringspaces=false,
showtabs=false,
tabsize=2
}
\lstset{style=mystyle, language=Python}
\author{Habib Ghaffari}
\date{2022-09-19 Mon}
\title{Tutorial \#2 - Working on your assignment}
\hypersetup{
 pdfauthor={Habib Ghaffari},
 pdftitle={Tutorial \#2 - Working on your assignment},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.5.2)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents



\section{Introduction}
\label{sec:org5ab51d3}

The objective of this tutorial is to work on some examples that will help you
with your assignments. For this tutorial, I am still going to continue working
with \texttt{Haskell}. The solutions we are presenting may/may not be related to your
assignment. It is your responsibility to find the relevance and try to figure out
how you could use it in your submissions. I am also going to give you a brief
introduction to the \texttt{Hakell} while I am presenting this tutorial.


\section{Objective}
\label{sec:org2bf516e}

\begin{itemize}
\item Becoming familiar with \texttt{Haskell}.
\item Learn how to expand the regular expression based on what we defined last
week.
\item Learn to apply \texttt{BNF} for our definitions.
\item Learn how to use \texttt{Haskell} for the implementation of a recursive parser to
parse our expressions.
\end{itemize}


\section{Learn how to work with \texttt{Haskell}}
\label{sec:orga32de30}

\subsection{Installing \texttt{Haskell} interpreter}
\label{sec:orgdef6eb4}

\texttt{GHCI} is \texttt{Haskell} interpreter It is an interactive environment, in which
\texttt{Haskell} expressions can be interactively evaluated and programs can be
interpreter. But in order to have the most stable installation, we recommend
you install \texttt{GHCI} using \texttt{Stack}.


\texttt{Stack} is a cross-platform program for developing Haskell projects. It is
aimed at Haskellers both new and experienced. In order to install \texttt{Stack} you
can download it for your machine and the OS you are using from \href{https://docs.haskellstack.org/en/stable/README/}{here}.


After installation of \texttt{Stack} there are some other things that you can do in
order to take the best out of it. One of the best IDEs for \texttt{Haskell}
implementation is \texttt{IntelliJ IDEA}. In order to make \texttt{Stack} work properly
with this IDE follow the instruction below.

\begin{itemize}
\item Open your \texttt{Terminal} or \texttt{Command Prompt} and run the following command
\end{itemize}

\begin{verbatim}
stack install hindent stylish-haskell
\end{verbatim}
\begin{itemize}
\item Download and install \texttt{IntelliJ IDEA}. Since you are a student you can use
\texttt{IDEA} and other IDEs of \texttt{IntelliJ} for free as long as you use your
academic email address. The process is straightforward. Just register for
an account in IntelliJ's website and apply for an activation license. You may
ask to renew your license annually.
\item Open \texttt{IDEA} and install \texttt{Intellij-Haskell} plugin and restart the IDE.
\item Open the \texttt{IDEA} again and make a new project.
\begin{itemize}
\item Select \texttt{Stack binary}.
\item In the next step choose the proper \texttt{SDK}. Most of the time \texttt{IDEA}
automatically going to detect the stack path. If not just manually select
it.
\end{itemize}
\end{itemize}

Now you are ready to start working with \texttt{IDEA} and \texttt{Haskell} programming.

\textbf{Note:} You can also use other IDEs such as \texttt{VSCode} while using \texttt{Stack}. For
that just try to find the proper instruction to configure your IDE.

Now it is time to do some \texttt{Haskell} programming.
