TUT materials/T2-3MI3/T2.org
** Introduction to ~Haskell~ programming

   The best resources to learn ~haskell~ programming are listed below:
   + [[http://learnyouahaskell.com]]
   + [[https://wiki.haskell.org/Learning_Haskell]]

 Here we are going to do some live coding which will introduce you to the ~types~
 and ~typeclasses~ as well as ~Algebraic Data types~.

 You can check the example [[./sample.hs][hs]] file later if you want to review the material.

 Let's define ~Efficiency~ and ~Safety~.

 + *Efficiency* means ease of use for the programmer, and ease of achieving the
   programming goals.
 + *Safety* means no unintended errors.


   + ~Haskell~ is a statically typed language. This means that the type errors
     can be caught at compile time. This makes ~Haskell~ a very safe language to
     work with.
   + The ~Haskell~ interpreter can usually infer the types of expressions based
     on the definitions you are making. In this manner, ~Haskell~ can be
     consider ~Efficient~ programming language. However, for more
     complicated functions and in most of the cases, it is better to write out
     the type signature of a function. It means more work for the developer
     which means less efficient programming language.
   + Indention is mandatory in ~Haskell~. Without ~Indention~ the interpreter
     may not able to detect the function definition, pattern matchings, etc
     without indention. Mandatory indention makes programming harder unless you
     use a proper IDE. Therefore in this matter, ~Haskell~ is not an ~Efficient~
     programming language.
   + ~Haskell~ can be written using braces and semi-colons, just like ~C~.
     However, no one does. Instead, the “layout” rule is used, where spaces
     represent scope. The general rule is: always indent. When the compiler
     complains, indent more. Based on this we can say ~Haskell~ has some sort of
     ~Efficiency~ for programmers as well.
   + ~Haskell~ uses Generational garbage collection (GC). In fact, it has
     one of the fastest garbage collection strategies known as nursery. However,
     it use a bit more space to handle the garbage collection. But it is not
     important for us when we are talking about ~safety~. So we could consider
     ~Haskell~ as a very ~safe~ programming language. For more information about
     garbage collection read the following link:

     [[https://www.channable.com/tech/lessons-in-managing-haskell-memory]]

Here I tried to cover some of the tasks you need to do for questions number 1 to
number 5. It is just a matter of investigation and figuring out how could you
compare ~efficiency~ vs ~safety~ when it comes to ~Python~.

** Naming Conventions in Haskell

Names in Haskell must satisfy the following simple rules:

+ Types and typeclasses must start with an uppercase letter
+ Functions and variables must start with a lowercase letter
+ Top-level operator functions must start with any allowed symbol except for
  ~:~.
+ Constructors as operators must start with ~:~.

Additionally, functions follow the ~lowerCamelCase~ style and types follow the
~UpperCamelCase~ style.

Lets consider Types / typeclasses / Functions / variables as identifiers. Now
lets define ~Haskell~ identifiers using the ~EBNF~:

#+begin_src text
  <H_ID> ::= <head> {<tail>}
  <head> ::= <upper> | <lower>
  <tail> ::= <upper> | <lower> | <special> | <digits> | '
  <lower> ::= a | b | c | d | e | f | g | h | i | j | k | l | m | n | o | p | q | r | s | t | u | v | w | x | y | z | _  (a-z) is accepted
  <upper> ::= A | B | C | D | E | F | G | H | I | J | K | L | M | N | O | P | Q | R | S | T | U | V | W | X | Y | Z (A-Z) is accepted
  <digits> ::= 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9  (0-9) is accepted
#+end_src

What if we want to use ~BNF~:

#+begin_src text
  Functions and Variables  # <H_ID> ::= <head>[<tail>]
                             <head> ::= <lower>
                             <tail> ::= <lower> | <upper>
                             ...
#+end_src

Exercise: Consider how we define the variable above, and try to  define the
following token:

- Unsigned integers with leading zeros allowed (Such as 0, 0001, 1, 200, 0220 etc.)

Make sure you check the ~Help~ page when you staring answering the questions.
You may find lots of useful information. Here is the link:

[[http://www.cas.mcmaster.ca/~franek/courses/cs3mi3/help/help.cgi]]

But you need to sign-in to see the information.

