TUT materials/T2-3MI3/T2.html

<div id="outline-container-org7b48af9" class="outline-3">
<h3 id="org7b48af9"><span class="section-number-3">3.2.</span> Introduction to <code>Haskell</code> programming</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The best resources to learn <code>haskell</code> programming are listed below:
</p>
<ul class="org-ul">
<li><a href="http://learnyouahaskell.com">http://learnyouahaskell.com</a></li>
<li><a href="https://wiki.haskell.org/Learning_Haskell">https://wiki.haskell.org/Learning_Haskell</a></li>
</ul>

<p>
Here we are going to do some live coding which will introduce you to the <code>types</code>
and <code>typeclasses</code> as well as <code>Algebraic Data types</code>.
</p>

<p>
You can check the example <a href="./sample.hs">hs</a> file later if you want to review the material.
</p>

<p>
Let's define <code>Efficiency</code> and <code>Safety</code>.
</p>

<ul class="org-ul">
<li><b>Efficiency</b> means ease of use for the programmer, and ease of achieving the
programming goals.</li>
<li><b>Safety</b> means no unintended errors.</li>
</ul>


<ul class="org-ul">
<li><code>Haskell</code> is a statically typed language. This means that the type errors
can be caught at compile time. This makes <code>Haskell</code> a very safe language to
work with.</li>
<li>The <code>Haskell</code> interpreter can usually infer the types of expressions based
on the definitions you are making. In this manner, <code>Haskell</code> can be
consider <code>Efficient</code> programming language. However, for more
complicated functions and in most of the cases, it is better to write out
the type signature of a function. It means more work for the developer
which means less efficient programming language.</li>
<li>Indention is mandatory in <code>Haskell</code>. Without <code>Indention</code> the interpreter
may not able to detect the function definition, pattern matchings, etc
without indention. Mandatory indention makes programming harder unless you
use a proper IDE. Therefore in this matter, <code>Haskell</code> is not an <code>Efficient</code>
programming language.</li>
<li><code>Haskell</code> can be written using braces and semi-colons, just like <code>C</code>.
However, no one does. Instead, the “layout” rule is used, where spaces
represent scope. The general rule is: always indent. When the compiler
complains, indent more. Based on this we can say <code>Haskell</code> has some sort of
<code>Efficiency</code> for programmers as well.</li>
<li><p>
<code>Haskell</code> uses Generational garbage collection (GC). In fact, it has
one of the fastest garbage collection strategies known as nursery. However,
it use a bit more space to handle the garbage collection. But it is not
important for us when we are talking about <code>safety</code>. So we could consider
<code>Haskell</code> as a very <code>safe</code> programming language. For more information about
garbage collection read the following link:
</p>

<p>
<a href="https://www.channable.com/tech/lessons-in-managing-haskell-memory">https://www.channable.com/tech/lessons-in-managing-haskell-memory</a>
</p></li>
</ul>

<p>
Here I tried to cover some of the tasks you need to do for questions number 1 to
number 5. It is just a matter of investigation and figuring out how could you
compare <code>efficiency</code> vs <code>safety</code> when it comes to <code>Python</code>.
</p>
</div>
</div>

<div id="outline-container-org32d03d3" class="outline-3">
<h3 id="org32d03d3"><span class="section-number-3">3.3.</span> Naming Conventions in Haskell</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Names in Haskell must satisfy the following simple rules:
</p>

<ul class="org-ul">
<li>Types and typeclasses must start with an uppercase letter</li>
<li>Functions and variables must start with a lowercase letter</li>
<li>Top-level operator functions must start with any allowed symbol except for
<code>:</code>.</li>
<li>Constructors as operators must start with <code>:</code>.</li>
</ul>

<p>
Additionally, functions follow the <code>lowerCamelCase</code> style and types follow the
<code>UpperCamelCase</code> style.
</p>

<p>
Lets consider Types / typeclasses / Functions / variables as identifiers. Now
lets define <code>Haskell</code> identifiers using the <code>EBNF</code>:
</p>

<div class="org-src-container">
<pre class="src src-text">&lt;H_ID&gt; ::= &lt;head&gt; {&lt;tail&gt;}
&lt;head&gt; ::= &lt;upper&gt; | &lt;lower&gt;
&lt;tail&gt; ::= &lt;upper&gt; | &lt;lower&gt; | &lt;special&gt; | &lt;digits&gt; | '
&lt;lower&gt; ::= a | b | c | d | e | f | g | h | i | j | k | l | m | n | o | p | q | r | s | t | u | v | w | x | y | z | _  (a-z) is accepted
&lt;upper&gt; ::= A | B | C | D | E | F | G | H | I | J | K | L | M | N | O | P | Q | R | S | T | U | V | W | X | Y | Z (A-Z) is accepted
&lt;digits&gt; ::= 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9  (0-9) is accepted
</pre>
</div>

<p>
What if we want to use <code>BNF</code>:
</p>

<div class="org-src-container">
<pre class="src src-text">Functions and Variables  # &lt;H_ID&gt; ::= &lt;head&gt;[&lt;tail&gt;]
                           &lt;head&gt; ::= &lt;lower&gt;
                           &lt;tail&gt; ::= &lt;lower&gt; | &lt;upper&gt;
                           ...
</pre>
</div>

<p>
Exercise: Consider how we define the variable above, and try to  define the
following token:
</p>

<ul class="org-ul">
<li>Unsigned integers with leading zeros allowed (Such as 0, 0001, 1, 200, 0220 etc.)</li>
</ul>

<p>
Make sure you check the <code>Help</code> page when you staring answering the questions.
You may find lots of useful information. Here is the link:
</p>

<p>
<a href="http://www.cas.mcmaster.ca/~franek/courses/cs3mi3/help/help.cgi">http://www.cas.mcmaster.ca/~franek/courses/cs3mi3/help/help.cgi</a>
</p>

<p>
But you need to sign-in to see the information.
</p>
</div>
</div>
</div>
