TUT materials/T2-3MI3/T2.tex

\subsection{Introduction to \texttt{Haskell} programming}
\label{sec:org39a8242}

The best resources to learn \texttt{haskell} programming are listed below:
\begin{itemize}
\item \url{http://learnyouahaskell.com}
\item \url{https://wiki.haskell.org/Learning\_Haskell}
\end{itemize}

Here we are going to do some live coding which will introduce you to the \texttt{types}
and \texttt{typeclasses} as well as \texttt{Algebraic Data types}.

You can check the example \href{./sample.hs}{hs} file later if you want to review the material.

Let's define \texttt{Efficiency} and \texttt{Safety}.

\begin{itemize}
\item \textbf{Efficiency} means ease of use for the programmer, and ease of achieving the
programming goals.
\item \textbf{Safety} means no unintended errors.
\end{itemize}


\begin{itemize}
\item \texttt{Haskell} is a statically typed language. This means that the type errors
can be caught at compile time. This makes \texttt{Haskell} a very safe language to
work with.
\item The \texttt{Haskell} interpreter can usually infer the types of expressions based
on the definitions you are making. In this manner, \texttt{Haskell} can be
consider \texttt{Efficient} programming language. However, for more
complicated functions and in most of the cases, it is better to write out
the type signature of a function. It means more work for the developer
which means less efficient programming language.
\item Indention is mandatory in \texttt{Haskell}. Without \texttt{Indention} the interpreter
may not able to detect the function definition, pattern matchings, etc
without indention. Mandatory indention makes programming harder unless you
use a proper IDE. Therefore in this matter, \texttt{Haskell} is not an \texttt{Efficient}
programming language.
\item \texttt{Haskell} can be written using braces and semi-colons, just like \texttt{C}.
However, no one does. Instead, the “layout” rule is used, where spaces
represent scope. The general rule is: always indent. When the compiler
complains, indent more. Based on this we can say \texttt{Haskell} has some sort of
\texttt{Efficiency} for programmers as well.
\item \texttt{Haskell} uses Generational garbage collection (GC). In fact, it has
one of the fastest garbage collection strategies known as nursery. However,
it use a bit more space to handle the garbage collection. But it is not
important for us when we are talking about \texttt{safety}. So we could consider
\texttt{Haskell} as a very \texttt{safe} programming language. For more information about
garbage collection read the following link:

\url{https://www.channable.com/tech/lessons-in-managing-haskell-memory}
\end{itemize}

Here I tried to cover some of the tasks you need to do for questions number 1 to
number 5. It is just a matter of investigation and figuring out how could you
compare \texttt{efficiency} vs \texttt{safety} when it comes to \texttt{Python}.

\subsection{Naming Conventions in Haskell}
\label{sec:org118f6fe}

Names in Haskell must satisfy the following simple rules:

\begin{itemize}
\item Types and typeclasses must start with an uppercase letter
\item Functions and variables must start with a lowercase letter
\item Top-level operator functions must start with any allowed symbol except for
\texttt{:}.
\item Constructors as operators must start with \texttt{:}.
\end{itemize}

Additionally, functions follow the \texttt{lowerCamelCase} style and types follow the
\texttt{UpperCamelCase} style.

Lets consider Types / typeclasses / Functions / variables as identifiers. Now
lets define \texttt{Haskell} identifiers using the \texttt{EBNF}:

\begin{verbatim}
<H_ID> ::= <head> {<tail>}
<head> ::= <upper> | <lower>
<tail> ::= <upper> | <lower> | <special> | <digits> | '
<lower> ::= a | b | c | d | e | f | g | h | i | j | k | l | m | n | o | p | q | r | s | t | u | v | w | x | y | z | _  (a-z) is accepted
<upper> ::= A | B | C | D | E | F | G | H | I | J | K | L | M | N | O | P | Q | R | S | T | U | V | W | X | Y | Z (A-Z) is accepted
<digits> ::= 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9  (0-9) is accepted
\end{verbatim}

What if we want to use \texttt{BNF}:

\begin{verbatim}
Functions and Variables  # <H_ID> ::= <head>[<tail>]
                           <head> ::= <lower>
                           <tail> ::= <lower> | <upper>
                           ...
\end{verbatim}

Exercise: Consider how we define the variable above, and try to  define the
following token:

\begin{itemize}
\item Unsigned integers with leading zeros allowed (Such as 0, 0001, 1, 200, 0220 etc.)
\end{itemize}

Make sure you check the \texttt{Help} page when you staring answering the questions.
You may find lots of useful information. Here is the link:

\url{http://www.cas.mcmaster.ca/\~franek/courses/cs3mi3/help/help.cgi}

But you need to sign-in to see the information.
