TUT materials/T2-3MI3/T2.org
* Language Definition


Let's jump to the language we started to define last week. Here is what we did
two weeks ago to refresh your mind:

#+begin_src text
 t ::=                             Term
         true                      Constant True
         false                     Constant False
         if t then t else t        Conditional Expression
         0                         Zero
         succ t                    Successor
         pred t                    Predecessor
         iszero t                  Zero Test
#+end_src

The only thing we do not have here is a strategy to write this language as a
text file such that an interpreter is able to read it and then evaluate it for
us. I am going to use the same strategy introduce in this file for tokens:

#+begin_src text
  EOI = 0 # Enf of input
  T = 1 # True
  F = 2 # False
  Z = 3 # Zero
  Succ = 4 # Successor
  Pred = 5 # Predecessor
  IsZero = 6 # Zero Test
  IfThenElse = 7  # Conditional Expression
#+end_src

Here is my grammar:

#+begin_src text
  expersion   : term | termTail
  termTail    : Succ term | Pred term | isZero term | ifThenElse term term term
  term        : T | F | Z
#+end_src

Now it is more clear. Right!

Let's see how we could recursively read an expression and evaluate it in ~Haskell~:

#+begin_src haskell
  data Term =
      T
    | F
    | Z
    | Succ term 
    | Pred term
    | IsZero term
    | IfThenElse term term term
#+end_src

Here are some expressions defined based on the above languge:

#+begin_src haskell
expr1 :: Term
expr1 = Succ (Succ (Succ Z))

expr2 :: Term
expr2 = ifThenElse T Z (Suc Z)
#+end_src
