TUT materials/T2-3MI3/T2.html

<div id="outline-container-orgb69901d" class="outline-2">
<h2 id="orgb69901d"><span class="section-number-2">4.</span> Language Definition</h2>
<div class="outline-text-2" id="text-4">
<p>
Let's jump to the language we started to define last week. Here is what we did
two weeks ago to refresh your mind:
</p>

<div class="org-src-container">
<pre class="src src-text">t ::=                             Term
        true                      Constant True
        false                     Constant False
        if t then t else t        Conditional Expression
        0                         Zero
        succ t                    Successor
        pred t                    Predecessor
        iszero t                  Zero Test
</pre>
</div>

<p>
The only thing we do not have here is a strategy to write this language as a
text file such that an interpreter is able to read it and then evaluate it for
us. I am going to use the same strategy introduce in this file for tokens:
</p>

<div class="org-src-container">
<pre class="src src-text">EOI = 0 # Enf of input
T = 1 # True
F = 2 # False
Z = 3 # Zero
Succ = 4 # Successor
Pred = 5 # Predecessor
IsZero = 6 # Zero Test
IfThenElse = 7  # Conditional Expression
</pre>
</div>

<p>
Here is my grammar:
</p>

<div class="org-src-container">
<pre class="src src-text">expersion   : term | termTail
termTail    : Succ term | Pred term | isZero term | ifThenElse term term term
term        : T | F | Z
</pre>
</div>

<p>
Now it is more clear. Right!
</p>

<p>
Let's see how we could recursively read an expression and evaluate it in <code>Haskell</code>:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #4f97d7; font-weight: bold;">data</span> <span style="color: #ce537a; font-weight: bold;">Term</span> <span style="color: #7590db;">=</span>
    <span style="color: #ce537a; font-weight: bold;">T</span>
  <span style="color: #7590db;">|</span> <span style="color: #ce537a; font-weight: bold;">F</span>
  <span style="color: #7590db;">|</span> <span style="color: #ce537a; font-weight: bold;">Z</span>
  <span style="color: #7590db;">|</span> <span style="color: #ce537a; font-weight: bold;">Succ</span> term 
  <span style="color: #7590db;">|</span> <span style="color: #ce537a; font-weight: bold;">Pred</span> term
  <span style="color: #7590db;">|</span> <span style="color: #ce537a; font-weight: bold;">IsZero</span> term
  <span style="color: #7590db;">|</span> <span style="color: #ce537a; font-weight: bold;">IfThenElse</span> term term term
</pre>
</div>

<p>
Here are some expressions defined based on the above languge:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">expr1</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Term</span>
<span style="color: #bc6ec5; font-weight: bold;">expr1</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">Succ</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">Succ</span> <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">Succ</span> <span style="color: #ce537a; font-weight: bold;">Z</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #bc6ec5; font-weight: bold;">expr2</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Term</span>
<span style="color: #bc6ec5; font-weight: bold;">expr2</span> <span style="color: #7590db;">=</span> ifThenElse <span style="color: #ce537a; font-weight: bold;">T</span> <span style="color: #ce537a; font-weight: bold;">Z</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">Suc</span> <span style="color: #ce537a; font-weight: bold;">Z</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-09-19 Mon</p>
<p class="author">Author: Habib Ghaffari</p>
<p class="date">Created: 2022-10-04 Tue 11:42</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
