TUT materials/T2-3MI3/T2.tex

\section{Language Definition}
\label{sec:org55fefb1}


Let's jump to the language we started to define last week. Here is what we did
two weeks ago to refresh your mind:

\begin{verbatim}
t ::=                             Term
        true                      Constant True
        false                     Constant False
        if t then t else t        Conditional Expression
        0                         Zero
        succ t                    Successor
        pred t                    Predecessor
        iszero t                  Zero Test
\end{verbatim}

The only thing we do not have here is a strategy to write this language as a
text file such that an interpreter is able to read it and then evaluate it for
us. I am going to use the same strategy introduce in this file for tokens:

\begin{verbatim}
EOI = 0 # Enf of input
T = 1 # True
F = 2 # False
Z = 3 # Zero
Succ = 4 # Successor
Pred = 5 # Predecessor
IsZero = 6 # Zero Test
IfThenElse = 7  # Conditional Expression
\end{verbatim}

Here is my grammar:

\begin{verbatim}
expersion   : term | termTail
termTail    : Succ term | Pred term | isZero term | ifThenElse term term term
term        : T | F | Z
\end{verbatim}

Now it is more clear. Right!

Let's see how we could recursively read an expression and evaluate it in \texttt{Haskell}:

\begin{verbatim}
data Term =
    T
  | F
  | Z
  | Succ term 
  | Pred term
  | IsZero term
  | IfThenElse term term term
\end{verbatim}

Here are some expressions defined based on the above languge:

\begin{verbatim}
expr1 :: Term
expr1 = Succ (Succ (Succ Z))

expr2 :: Term
expr2 = ifThenElse T Z (Suc Z)
\end{verbatim}
\end{document}